* Linux kernel

Improving the Linux kernel.

#+BEGIN: clocktable :scope (lambda () (enzuru-org-files-by-tag "kernel")) :maxlevel 1
#+CAPTION: Clock summary at [2025-11-21 Fri 23:19]
| File                              | Headline                         | Time   |
|-----------------------------------+----------------------------------+--------|
|                                   | ALL *Total time*                 | *2:11* |
|-----------------------------------+----------------------------------+--------|
| kernel-magic-trackpad-battery.org | *File time*                      | *2:11* |
|                                   | Magic Trackpad battery reporting | 2:11   |
#+END:

** Projects
*** [[../projects/kernel-magic-trackpad-battery.org][Apple Magic Trackpad battery reporting]]

** Patching
To patch the Linux kernel with your changes already staged:
#+BEGIN_SRC sh
  git diff --cached > changes.patch
#+END_SRC

*** Nix
**** LSP
#+BEGIN_SRC sh
  nix develop nixpkgs#linux
  make -j9 defconfig
  make -j9
  scripts/clang-tools/gen_compile_commands.py
#+END_SRC

**** Booting
#+BEGIN_SRC nix
  # In your /etc/nixos/configuration.nix or a separate module
  { config, pkgs, ... }:

  {
    boot.kernelPackages = pkgs.linuxPackages.extend (self: super: {
      kernel = super.kernel.overrideAttrs (oldAttrs: {
        src = pkgs.lib.cleanSource /path/to/your/linux/source/tree;  # Point to your patched source
        # Or if you want to apply patches to the existing kernel:
        patches = (oldAttrs.patches or []) ++ [
          /path/to/your/patch/file.patch
        ];
      });
    });

    # Rest of your configuration...
  }
#+END_SRC

You may need to do "make mrproper" to clean up the dir before using on Nix.

*** Guix
**** LSP
#+BEGIN_SRC sh
  guix environment linux
  make -j9 CC=clang defconfig
  make -j9 CC=clang
  scripts/clang-tools/gen_compile_commands.py
#+END_SRC

**** Booting
Create a folder with the patch (`/home/enzuru/src/linux-patch/custom-kernel.scm`) and a file like this:
#+BEGIN_SRC scheme
  (define-module (custom-kernel)
    #:use-module (gnu packages)
    #:use-module (gnu packages linux)
    #:use-module (nongnu packages linux)
    #:use-module (guix packages)
    #:use-module (guix download)
    #:use-module (guix build-system)
    #:use-module (guix gexp)
    #:export (linux-with-ext4-strscpy))
  ;; Define your custom kernel with the  patch
  (define-public linux-with-patch
    (package
     (inherit linux) ;; Inheriting from nonguix's linux package
      (name "linux-with-patch")
      (source
       (origin
         (inherit (package-source linux))
          (patches (append (origin-patches (package-source linux))
                           (list (local-file "/home/enzuru/src/linux/changes.patch"
                                             "changes.patch"))))))))
#+END_SRC

Include (custom-kernel) in your config.scm dependencies and then:
#+BEGIN_SRC scheme
  (operating-system (kernel linux-with-patch))
#+END_SRC

Then run this command:
#+BEGIN_SRC sh
  sudo guix system reconfigure -L /home/enzuru/src/linux-patch config.scm
#+END_SRC
